###############################################################################
# Created by write_sdc
###############################################################################
current_design rv32i_core
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 30.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clkEn}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusInEn}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[0]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[10]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[11]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[12]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[13]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[14]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[15]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[16]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[17]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[18]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[19]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[1]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[20]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[21]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[22]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[23]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[24]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[25]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[26]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[27]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[28]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[29]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[2]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[30]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[31]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[3]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[4]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[5]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[6]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[7]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[8]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusIn[9]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[0]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[10]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[11]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[12]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[13]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[14]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[15]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[16]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[17]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[18]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[19]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[1]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[20]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[21]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[22]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[23]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[24]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[25]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[26]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[27]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[28]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[29]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[2]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[30]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[31]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[3]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[4]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[5]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[6]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[7]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[8]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inst_in[9]}]
set_input_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rstB}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RamMode[0]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RamMode[1]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RamMode[2]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {RamMode[3]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[0]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[10]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[11]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[12]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[13]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[14]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[15]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[16]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[17]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[18]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[19]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[1]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[20]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[21]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[22]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[23]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[24]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[25]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[26]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[27]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[28]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[29]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[2]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[30]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[31]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[3]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[4]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[5]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[6]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[7]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[8]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr[9]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[0]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[10]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[11]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[12]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[13]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[14]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[15]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[16]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[17]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[18]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[19]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[1]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[20]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[21]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[22]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[23]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[24]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[25]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[26]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[27]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[28]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[29]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[2]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[30]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[31]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[3]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[4]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[5]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[6]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[7]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[8]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dataBusOut[9]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[0]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[10]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[11]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[12]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[13]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[14]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[15]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[16]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[17]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[18]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[19]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[1]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[20]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[21]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[22]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[23]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[24]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[25]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[26]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[27]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[28]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[29]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[2]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[30]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[31]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[3]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[4]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[5]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[6]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[7]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[8]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc[9]}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rdEn}]
set_output_delay 6.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wrEn}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {rdEn}]
set_load -pin_load 0.0334 [get_ports {wrEn}]
set_load -pin_load 0.0334 [get_ports {RamMode[3]}]
set_load -pin_load 0.0334 [get_ports {RamMode[2]}]
set_load -pin_load 0.0334 [get_ports {RamMode[1]}]
set_load -pin_load 0.0334 [get_ports {RamMode[0]}]
set_load -pin_load 0.0334 [get_ports {addr[31]}]
set_load -pin_load 0.0334 [get_ports {addr[30]}]
set_load -pin_load 0.0334 [get_ports {addr[29]}]
set_load -pin_load 0.0334 [get_ports {addr[28]}]
set_load -pin_load 0.0334 [get_ports {addr[27]}]
set_load -pin_load 0.0334 [get_ports {addr[26]}]
set_load -pin_load 0.0334 [get_ports {addr[25]}]
set_load -pin_load 0.0334 [get_ports {addr[24]}]
set_load -pin_load 0.0334 [get_ports {addr[23]}]
set_load -pin_load 0.0334 [get_ports {addr[22]}]
set_load -pin_load 0.0334 [get_ports {addr[21]}]
set_load -pin_load 0.0334 [get_ports {addr[20]}]
set_load -pin_load 0.0334 [get_ports {addr[19]}]
set_load -pin_load 0.0334 [get_ports {addr[18]}]
set_load -pin_load 0.0334 [get_ports {addr[17]}]
set_load -pin_load 0.0334 [get_ports {addr[16]}]
set_load -pin_load 0.0334 [get_ports {addr[15]}]
set_load -pin_load 0.0334 [get_ports {addr[14]}]
set_load -pin_load 0.0334 [get_ports {addr[13]}]
set_load -pin_load 0.0334 [get_ports {addr[12]}]
set_load -pin_load 0.0334 [get_ports {addr[11]}]
set_load -pin_load 0.0334 [get_ports {addr[10]}]
set_load -pin_load 0.0334 [get_ports {addr[9]}]
set_load -pin_load 0.0334 [get_ports {addr[8]}]
set_load -pin_load 0.0334 [get_ports {addr[7]}]
set_load -pin_load 0.0334 [get_ports {addr[6]}]
set_load -pin_load 0.0334 [get_ports {addr[5]}]
set_load -pin_load 0.0334 [get_ports {addr[4]}]
set_load -pin_load 0.0334 [get_ports {addr[3]}]
set_load -pin_load 0.0334 [get_ports {addr[2]}]
set_load -pin_load 0.0334 [get_ports {addr[1]}]
set_load -pin_load 0.0334 [get_ports {addr[0]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[31]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[30]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[29]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[28]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[27]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[26]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[25]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[24]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[23]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[22]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[21]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[20]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[19]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[18]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[17]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[16]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[15]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[14]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[13]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[12]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[11]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[10]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[9]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[8]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[7]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[6]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[5]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[4]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[3]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[2]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[1]}]
set_load -pin_load 0.0334 [get_ports {dataBusOut[0]}]
set_load -pin_load 0.0334 [get_ports {pc[31]}]
set_load -pin_load 0.0334 [get_ports {pc[30]}]
set_load -pin_load 0.0334 [get_ports {pc[29]}]
set_load -pin_load 0.0334 [get_ports {pc[28]}]
set_load -pin_load 0.0334 [get_ports {pc[27]}]
set_load -pin_load 0.0334 [get_ports {pc[26]}]
set_load -pin_load 0.0334 [get_ports {pc[25]}]
set_load -pin_load 0.0334 [get_ports {pc[24]}]
set_load -pin_load 0.0334 [get_ports {pc[23]}]
set_load -pin_load 0.0334 [get_ports {pc[22]}]
set_load -pin_load 0.0334 [get_ports {pc[21]}]
set_load -pin_load 0.0334 [get_ports {pc[20]}]
set_load -pin_load 0.0334 [get_ports {pc[19]}]
set_load -pin_load 0.0334 [get_ports {pc[18]}]
set_load -pin_load 0.0334 [get_ports {pc[17]}]
set_load -pin_load 0.0334 [get_ports {pc[16]}]
set_load -pin_load 0.0334 [get_ports {pc[15]}]
set_load -pin_load 0.0334 [get_ports {pc[14]}]
set_load -pin_load 0.0334 [get_ports {pc[13]}]
set_load -pin_load 0.0334 [get_ports {pc[12]}]
set_load -pin_load 0.0334 [get_ports {pc[11]}]
set_load -pin_load 0.0334 [get_ports {pc[10]}]
set_load -pin_load 0.0334 [get_ports {pc[9]}]
set_load -pin_load 0.0334 [get_ports {pc[8]}]
set_load -pin_load 0.0334 [get_ports {pc[7]}]
set_load -pin_load 0.0334 [get_ports {pc[6]}]
set_load -pin_load 0.0334 [get_ports {pc[5]}]
set_load -pin_load 0.0334 [get_ports {pc[4]}]
set_load -pin_load 0.0334 [get_ports {pc[3]}]
set_load -pin_load 0.0334 [get_ports {pc[2]}]
set_load -pin_load 0.0334 [get_ports {pc[1]}]
set_load -pin_load 0.0334 [get_ports {pc[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clkEn}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusInEn}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rstB}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dataBusIn[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inst_in[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
